app/Models/salle_2/Salle2Model.php

SELECT `libelle`
FROM `explication`
WHERE `numero` = 1
---
    public function getIntroduction()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('explication');

        $query = $builder->select('libelle')
            ->distinct()
            ->whereIn('numero', [1])
            ->get(); // exécute la requête