app/Models/salle_5/ActiviteModel.php

SELECT *
FROM `activite`
WHERE `salle_numero` = 5
ORDER BY RAND()
 LIMIT 2
---
    public function getActivitesAleatoires($salle_numero, $limit = 2)
    {
        return $this->where('salle_numero', $salle_numero)
            ->orderBy('RAND()')
            ->limit($limit)
            ->findAll();

SELECT *
FROM `activite`
WHERE `activite`.`numero` = '9'
---
    public function getActivite($numero)
    {
        return $this->find($numero);