app/Models/salle_5/ExplicationModel.php

SELECT *
FROM `explication`
WHERE `explication`.`numero` = '9'
---
    public function getExplication($numero)
    {
        return $this->find($numero);