app/Models/salle_5/MascotteModel.php

SELECT *
FROM `mascotte`
WHERE `salle_numero` = 5
SELECT *
FROM `mascotte`
WHERE `salle_numero` = 5
 LIMIT 1
---
    function getMascotte(int $idSalle){
        $result = false;
        $db = db_connect();
        $query = $db->table('mascotte')
            ->where('salle_numero', $idSalle)
            ->get();
        if($query->getNumRows() > 0){
            $result = $query->getRow();