app/Models/salle_5/ModeEmploiModel.php

SELECT *
FROM `mode_emploi`
WHERE `activite_numero` = '9'
 LIMIT 1
---
    public function getModeEmploiByActivite($activite_numero)
    {
        return $this->where('activite_numero', $activite_numero)->first();