app/Models/salle_5/SalleModel.php

    function getSalle(int $idSalle){
        $result = false;
        $db = db_connect();
        $query = $db->table('salle')
        ->where('numero', $idSalle)
        ->get();
        if($query->getNumRows() > 0){
            $result = $query->getRow();
---
SELECT *
FROM `salle`
WHERE `numero` = 5
SELECT *
FROM `salle`
WHERE `salle`.`numero` = 5