app/Models/salle_5/ZoneModel.php

    public function countBonnesReponses($activite_numero)
    {
        return $this->db->table('zone')
            ->join('avoir_zone', 'avoir_zone.zone_numero = zone.numero')
            ->where('avoir_zone.activite_numero', $activite_numero)
            ->where('zone.bonne_reponse', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `zone`
JOIN `avoir_zone` ON `avoir_zone`.`zone_numero` = `zone`.`numero`
WHERE `avoir_zone`.`activite_numero` = '4'
AND `zone`.`bonne_reponse` = 1

    public function verifierZone($activite_numero, $zone_nom)
    {
        $zone = $this->db->table('zone')
            ->select('zone.*')
            ->join('avoir_zone', 'avoir_zone.zone_numero = zone.numero')
            ->where('avoir_zone.activite_numero', $activite_numero)
            ->where('zone.nom', $zone_nom)
            ->get()
            ->getRow();
---
SELECT `zone`.*
FROM `zone`
JOIN `avoir_zone` ON `avoir_zone`.`zone_numero` = `zone`.`numero`
WHERE `avoir_zone`.`activite_numero` = '4'
AND `zone`.`nom` = 'post_it'