app/Models/salle_6/proposerWifiModel.php

    public function getBonWifiAlea($activite_numero)
    {
        return $this->select('proposer_wifi.*, wifi.public, wifi.chiffrement')
            ->join('wifi', 'wifi.numero = proposer_wifi.wifi_numero')
            ->where('proposer_wifi.activite_numero', $activite_numero)
            ->where('proposer_wifi.bonne_reponse', 1)
            ->orderBy('RAND()')
            ->first();
---
SELECT `proposer_wifi`.*, `wifi`.`public`, `wifi`.`chiffrement`
FROM `proposer_wifi`
JOIN `wifi` ON `wifi`.`numero` = `proposer_wifi`.`wifi_numero`
WHERE `proposer_wifi`.`activite_numero` = 1
AND `proposer_wifi`.`bonne_reponse` = 1
ORDER BY RAND()
 LIMIT 1

    public function getMauvaisWifiAlea($activite_numero, $limit = 2)
    {
        return $this->select('proposer_wifi.*, wifi.public, wifi.chiffrement')
            ->join('wifi', 'wifi.numero = proposer_wifi.wifi_numero')
            ->where('proposer_wifi.activite_numero', $activite_numero)
            ->where('proposer_wifi.bonne_reponse', 0)
            ->orderBy('RAND()')
            ->limit($limit)
            ->findAll();
---
SELECT `proposer_wifi`.*, `wifi`.`public`, `wifi`.`chiffrement`
FROM `proposer_wifi`
JOIN `wifi` ON `wifi`.`numero` = `proposer_wifi`.`wifi_numero`
WHERE `proposer_wifi`.`activite_numero` = 1
AND `proposer_wifi`.`bonne_reponse` = 0
ORDER BY RAND()
 LIMIT 2