app/Models/admin/UserModel.php

SELECT *
FROM `user`
WHERE `login` = 'AdminMIVDL'
 LIMIT 1
---
    public function getUser($login)
    {
        return $this->where('login', $login)->first();