app/Models/salle_1/Salle1Message.php

    public function getMessageSalle1()
    {
        return $this->db->table('activite a')
            ->select('a.numero, a.libelle,
                      aut.nom, aut.prenom')
            ->join('auteur aut', 'aut.numero = a.auteur_numero', 'left')
            ->where('a.salle_numero', 1)
            ->orderBy('RAND()')
            ->limit(1)
            ->get()
            ->getRow();
---
SELECT `a`.`numero`, `a`.`libelle`, `aut`.`nom`, `aut`.`prenom`
FROM `activite` `a`
LEFT JOIN `auteur` `aut` ON `aut`.`numero` = `a`.`auteur_numero`
WHERE `a`.`salle_numero` = 1
ORDER BY RAND()
 LIMIT 1

    public function getMotsSuspects(int $activite_numero): array
    {
        $erreurs = $this->db->table('erreur')
            ->select('mot_incorrect, explication')
            ->where('activite_numero', $activite_numero)
            ->get()
            ->getResultArray();
---
SELECT `mot_incorrect`, `explication`
FROM `erreur`
WHERE `activite_numero` = 2

    public function getErreursAvecExplications(int $activite_numero): array
    {
        return $this->db->table('erreur')
            ->select('numero, mot_incorrect, explication')
            ->where('activite_numero', $activite_numero)
            ->get()
            ->getResultArray();
---
SELECT `numero`, `mot_incorrect`, `explication`
FROM `erreur`
WHERE `activite_numero` = 2

    public function getIndices(int $activite_numero): array
    {
        return $this->db->table('avoir_indice ai')
            ->select('i.numero, i.libelle')
            ->join('indice i', 'i.numero = ai.indice_numero')
            ->where('ai.activite_numero', $activite_numero)
            ->get()
            ->getResultArray();
---
SELECT `i`.`numero`, `i`.`libelle`
FROM `avoir_indice` `ai`
JOIN `indice` `i` ON `i`.`numero` = `ai`.`indice_numero`
WHERE `ai`.`activite_numero` = 2