app/Models/admin/salle_1/Salle1Admin.php

    public function getTousMessageSalle1()
    {
        return $this->db->table('activite a')
            ->select('a.numero, a.libelle')
            ->where('a.salle_numero', 1)
            ->get()
            ->getResultArray();
---
SELECT `a`.`numero`, `a`.`libelle`
FROM `activite` `a`
WHERE `a`.`salle_numero` = 1
ORDER BY RAND()

    public function getTousErreursAvecExplications(int $activite_numero): array
    {
        return $this->db->table('erreur')
            ->select('numero, mot_incorrect, explication')
            ->get()
            ->getResultArray();
---
SELECT `numero`, `mot_incorrect`, `explication`
FROM `erreur`

    public function getTousIndices(int $activite_numero): array
    {
        return $this->db->table('avoir_indice ai')
            ->select('i.numero, i.libelle')
            ->join('indice i', 'i.numero = ai.indice_numero')
            ->get()
            ->getResultArray();
---
SELECT `i`.`numero`, `i`.`libelle`
FROM `avoir_indice` `ai`
JOIN `indice` `i` ON `i`.`numero` = `ai`.`indice_numero`